## **Task**

Dataset Link: https://github.com/abdelrahman1alaa/Python-For-Beginners/blob/main/08-%20Orders.csv


**-Your first mission! Analyze a small dataset of customer orders and product sales.** 

**-Your client wants quick insights to share with the marketing team.**

**-You'll write Python code to clean and explore the data, answer business questions, and visualize patterns.**

## - Imoprting Libraries.

In [ ]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt

## Reading The Data Using Pandas

In [ ]:
df = pd.read_csv("Orders.csv")
df.head()

   order_id customer_name     product  quantity  unit_price  order_date
0         1         Maria  Kiwi Chips         2         3.0  2024-01-29
1         2       Richard  Kiwi Chips         1         3.0  2024-01-08
2         3      Nicholas  Kiwi Candy         1         2.5  2024-01-25
3         4       Raymond  Kiwi Candy         4         NaN  2024-01-04
4         5         David  Kiwi Juice         1         4.5  2024-02-25

## What Is The Shape Of CSV File ?

In [5]:
df.shape

(100, 6)

## Some of the orders are missing the unit_price.

**-Your task is to fill in each missing price using the average price for that same product, then Calculate total revenue across all orders.**

    -(Note: you need to have total price before calculating total revenue.)


**What is the total revenue after filling in the missing unit prices with the average price for each product?**

In [10]:
df['unit_price'] = df['unit_price'].fillna(df['unit_price'].mean())

In [12]:
df['unit_price'].head()

0    3.000000
1    3.000000
2    2.500000
3    3.961957
4    4.500000
Name: unit_price, dtype: float64

In [13]:
df['total_price'] = df['quantity']*df['unit_price']

In [15]:
df.head()

,order_id,customer_name,product,quantity,unit_price,order_date,total_price
0,1,Maria,Kiwi Chips,2,3.000000,2024-01-29,6.000000
1,2,Richard,Kiwi Chips,1,3.000000,2024-01-08,3.000000
2,3,Nicholas,Kiwi Candy,1,2.500000,2024-01-25,2.500000
3,4,Raymond,Kiwi Candy,4,3.961957,2024-01-04,15.847826
4,5,David,Kiwi Juice,1,4.500000,2024-02-25,4.500000

In [16]:
df['total_revenue'] = df['total_price'].sum()

In [17]:
df.head()

,order_id,customer_name,product,quantity,unit_price,order_date,total_price,total_revenue
0,1,Maria,Kiwi Chips,2,3.000000,2024-01-29,6.000000,1161.23913
1,2,Richard,Kiwi Chips,1,3.000000,2024-01-08,3.000000,1161.23913
2,3,Nicholas,Kiwi Candy,1,2.500000,2024-01-25,2.500000,1161.23913
3,4,Raymond,Kiwi Candy,4,3.961957,2024-01-04,15.847826,1161.23913
4,5,David,Kiwi Juice,1,4.500000,2024-02-25,4.500000,1161.23913

## Which product has the highest total quantity sold?

In [21]:
print(df['quantity'].max())

5

In [25]:
df.groupby("product")["quantity"].sum().idxmax()

'Kiwi Chips'

## Which customer has the highest total spending across all orders?

In [29]:
df.groupby("customer_name")["total_price"].sum().idxmax()

'Eric'

**This Notebook Made By : Abdelrahman Alaa**

 **LinkedIn:**
  **https://www.linkedin.com/in/abdelrahman1alaa**


**GitHub** : **https://github.com/abdelrahman1alaa**